postgrest/RESULTS_SIMPLE_UPDATE.txt
# pgrbench-all-pg-instances repeat 3 pgrbench-pgbench-varied-clients -b simple-update > RESULTS_SIMPLE_UPDATE.txt

Instance: m5a.large


Run: 1


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 71718
latency average = 4.185 ms
tps = 2389.563583 (including connections establishing)
tps = 2390.285658 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 93503
latency average = 16.074 ms
tps = 3110.580391 (including connections establishing)
tps = 3112.931843 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 90197
latency average = 33.374 ms
tps = 2996.362024 (including connections establishing)
tps = 2999.954879 (excluding connections establishing)

Run: 2


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 100126
latency average = 2.998 ms
tps = 3336.013891 (including connections establishing)
tps = 3337.221527 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 101001
latency average = 14.880 ms
tps = 3360.207162 (including connections establishing)
tps = 3363.247282 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 92183
latency average = 32.693 ms
tps = 3058.739986 (including connections establishing)
tps = 3062.446349 (excluding connections establishing)

Run: 3


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 100655
latency average = 2.982 ms
tps = 3352.995779 (including connections establishing)
tps = 3354.147853 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 101231
latency average = 14.845 ms
tps = 3368.191986 (including connections establishing)
tps = 3370.795075 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 91886
latency average = 32.769 ms
tps = 3051.642368 (including connections establishing)
tps = 3055.059403 (excluding connections establishing)

Instance: m5a.xlarge


Run: 1


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 78069
latency average = 3.845 ms
tps = 2601.014128 (including connections establishing)
tps = 2601.515085 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 190835
latency average = 7.887 ms
tps = 6339.388227 (including connections establishing)
tps = 6342.568187 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 178633
latency average = 16.849 ms
tps = 5935.006074 (including connections establishing)
tps = 5939.071198 (excluding connections establishing)

Run: 2


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 121353
latency average = 2.473 ms
tps = 4043.667007 (including connections establishing)
tps = 4044.467476 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 200948
latency average = 7.479 ms
tps = 6685.620586 (including connections establishing)
tps = 6689.760845 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 182316
latency average = 16.509 ms
tps = 6057.402281 (including connections establishing)
tps = 6062.227238 (excluding connections establishing)

Run: 3


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 120171
latency average = 2.498 ms
tps = 4003.285962 (including connections establishing)
tps = 4004.139654 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 198826
latency average = 7.568 ms
tps = 6606.429351 (including connections establishing)
tps = 6610.290286 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 181406
latency average = 16.596 ms
tps = 6025.660144 (including connections establishing)
tps = 6029.308085 (excluding connections establishing)

Instance: m5a.2xlarge


Run: 1


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 77066
latency average = 3.893 ms
tps = 2568.557623 (including connections establishing)
tps = 2568.889393 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 333417
latency average = 4.506 ms
tps = 11096.853734 (including connections establishing)
tps = 11098.909107 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 351202
latency average = 8.561 ms
tps = 11680.522538 (including connections establishing)
tps = 11683.062496 (excluding connections establishing)

Run: 2


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 127831
latency average = 2.347 ms
tps = 4260.669057 (including connections establishing)
tps = 4261.215622 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 368189
latency average = 4.078 ms
tps = 12261.022015 (including connections establishing)
tps = 12263.229526 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 350780
latency average = 8.576 ms
tps = 11660.450987 (including connections establishing)
tps = 11662.824464 (excluding connections establishing)

Run: 3


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 125677
latency average = 2.388 ms
tps = 4187.189945 (including connections establishing)
tps = 4187.735694 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 360378
latency average = 4.168 ms
tps = 11996.069328 (including connections establishing)
tps = 11998.277971 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 347831
latency average = 8.671 ms
tps = 11532.572639 (including connections establishing)
tps = 11534.776619 (excluding connections establishing)

Instance: m5a.4xlarge


Run: 1


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 76655
latency average = 3.914 ms
tps = 2554.885311 (including connections establishing)
tps = 2555.212819 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 417439
latency average = 3.598 ms
tps = 13896.553337 (including connections establishing)
tps = 13898.518769 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 577810
latency average = 5.198 ms
tps = 19237.811687 (including connections establishing)
tps = 19241.420481 (excluding connections establishing)

Run: 2


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 125314
latency average = 2.394 ms
tps = 4176.804447 (including connections establishing)
tps = 4177.310593 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 445514
latency average = 3.372 ms
tps = 14825.919325 (including connections establishing)
tps = 14827.893048 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 581869
latency average = 5.163 ms
tps = 19368.067360 (including connections establishing)
tps = 19371.530146 (excluding connections establishing)

Run: 3


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 122145
latency average = 2.456 ms
tps = 4071.132393 (including connections establishing)
tps = 4071.630803 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 443941
latency average = 3.382 ms
tps = 14783.629018 (including connections establishing)
tps = 14785.837779 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 568909
latency average = 5.293 ms
tps = 18893.949035 (including connections establishing)
tps = 18897.323462 (excluding connections establishing)

Instance: m5a.8xlarge


Run: 1


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 76076
latency average = 3.944 ms
tps = 2535.627728 (including connections establishing)
tps = 2535.959556 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 423699
latency average = 3.542 ms
tps = 14116.345683 (including connections establishing)
tps = 14118.357792 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 654532
latency average = 4.587 ms
tps = 21799.961010 (including connections establishing)
tps = 21803.486739 (excluding connections establishing)

Run: 2


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 124746
latency average = 2.405 ms
tps = 4157.829417 (including connections establishing)
tps = 4158.325772 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 462967
latency average = 3.242 ms
tps = 15422.871260 (including connections establishing)
tps = 15425.225253 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 640719
latency average = 4.687 ms
tps = 21337.180677 (including connections establishing)
tps = 21340.934678 (excluding connections establishing)

Run: 3


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 123760
latency average = 2.424 ms
tps = 4125.101578 (including connections establishing)
tps = 4125.598377 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 453014
latency average = 3.314 ms
tps = 15088.246838 (including connections establishing)
tps = 15090.212287 (excluding connections establishing)


transaction type: <builtin: simple update>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 650088
latency average = 4.618 ms
tps = 21653.562225 (including connections establishing)
tps = 21657.574587 (excluding connections establishing)